#  ------------------------کدهای رنگی -----------------
RED = "\033[91m"     # مردود
YELLOW = "\033[93m"  # قبول با نمره متوسط
GREEN = "\033[92m"   # قبول با نمره عالی
RESET = "\033[0m"    # بازنشانی رنگ
#------------------------------------------------------

scores = [10, 14, 18, 11, 16, 20]

for score in scores:
    if score < 12:
        print(f"{RED}نمره {score}: مردود{RESET}")
    elif score <= 16:
        print(f"{YELLOW}نمره {score}: قبول با نمره متوسط{RESET}")
    else:
        print(f"{GREEN}نمره {score}: قبول با نمره عالی{RESET}")