
#  ------------------------کدهای رنگی -----------------
RED = "\033[41m"     # موجودی کم
GREEN = "\033[42m"   # موجودی مناسب
YELLOW = "\033[43m"  # موجودی زیاد
RESET = "\033[0m"    # بازنشانی رنگ
#------------------------------------------------------

inventory = [3, 15, 7, 25, 12, 2, 18]
for stock in inventory:
    if stock < 5:
        print(f"{RED}موجودی کالا با تعداد {stock}: موجودی کم است{RESET}")
    elif stock > 20:
        print(f"{YELLOW}موجودی کالا با تعداد {stock}: موجودی زیاد است{RESET}")
    else:
        print(f"{GREEN}موجودی کالا با تعداد {stock}: موجودی مناسب است{RESET}")